# FilterStringBeginsWith Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringBeginsWith Class
Members See Also
---
Tests whether string values from the document begin with a certain string.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FilterStringBeginsWith : FilterStringRuleEvaluator
```

Visual Basic
---
```text
Public Class FilterStringBeginsWith _
	Inherits FilterStringRuleEvaluator
```

Visual C++
---
```text
public ref class FilterStringBeginsWith : public FilterStringRuleEvaluator
```

# Remarks
All string comparisons in this class are performed in the case-insensitive manner.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterStringRuleEvaluator Autodesk.Revit.DB..::..FilterStringBeginsWith
# See Also
FilterStringBeginsWith Members
Autodesk.Revit.DB Namespace